export const data = [
    {
        question: "Який діапазон значень в аналогових пінів на Arduino Uno?",
        answers1: "0 - 255",
        answers2: "0 - 1023",
        answers3: "0 - 1024",
        answers4: "0 - 256",
        correct: 2
    },
    {
        img: '/1.jpg',
        question: "Що це за пристрій?",
        answers1: "Фоторезистор",
        answers2: "Кнопка",
        answers3: "Датчик вібрації",
        answers4: "Потенціометр",
        correct: 4
    },
    {
        img: '/1.jpg',
        question: "Скільки контактів підключення має потенціометр?",
        answers1: "5",
        answers2: "2",
        answers3: "4",
        answers4: "3",
        correct: 4
    },
    {
        img: '/2.jpg',
        question: "Що це за пристрій?",
        answers1: "Світлодіодна стрічка",
        answers2: "Масив кнопок",
        answers3: "Датчик світла",
        answers4: "Піаніно",
        correct: 1
    },
    {
        img: '/3.jpg',
        question: "Для чого потрібна блок map?",
        answers1: "Для створення умови в алгоритмі",
        answers2: "Для повторення певної дії",
        answers3: "Для побудови мапи алгоритму",
        answers4: "Для перетворення одного діапазон значень на інший",
        correct: 4
    },
    {
        img: '/4.jpg',
        question: "Що це за пристрій?",
        answers1: "Сегментний індикатор",
        answers2: "Дісплей",
        answers3: "Цифровий таймер",
        answers4: "Набір світлодіодів",
        correct: 3
    },
    {
        question: "Для чого потрібна підпрограмма?",
        answers1: "Для оптимізації програми",
        answers2: "Для того, щоб світлодіоди світили яскравіше",
        answers3: "Для програмування сегментного індикатора",
        answers4: "Для паралельного програмування кількох датчиків",
        correct: 1
    },
    {
        question: "Чи можна викликати одну підпрограму в іншій?",
        answers1: "Для перетворення одного діапазон значень на інший",
        answers2: "Ні",
        answers3: "Для побудови мапи алгоритму",
        answers4: "Для створення умови в алгоритмі",
        correct: 2
    },
    {
        img: '/4.jpg',
        question: "Навіщо потрібен резистор при підключенні сегментного індикатора?",
        answers1: "Для того, щоб світлодіоди світили яскравіше",
        answers2: "Для того, щоб можна було засвітити всі 10 цифр",
        answers3: "Для того, щоб сегментний індикатор сприймав код з підпрограмами",
        answers4: "Для того, щоб зменшити струм та не спалити пристрій",
        correct: 4
    },
    {
        img: '/5.jpg',
        question: "Що це за пристрій?",
        answers1: "Фоторезистор",
        answers2: "Датчик перешкоди",
        answers3: "УЗ дальномір",
        answers4: "Камера",
        correct: 3
    },
    {
        img: '/5.jpg',
        question: "За що відповідають піни trig та echo в УЗ дальномірі?",
        answers1: "Trig - відправляє звуковий сигнал у повітря, а Echo приймає відбитий",
        answers2: "Echo - відправляє звуковий сигнал у повітря, а Trig приймає відбитий",
        answers3: "Обидва піни відправлять звукові сигнали, які потім порівнюються",
        answers4: "Немає різниці",
        correct: 1
    },
    {
        img: '/5.jpg',
        question: "Як розшифровується САГ?",
        answers1: "Система аварійного гальмування",
        answers2: "Система автоматичного гальмування",
        answers3: "Система автомобільного гальмування",
        answers4: "Система автоматизованого гальмування",
        correct: 1
    },
    {
        question: "Які тварини орієнтуються за допомогою ехолокації?",
        answers1: "Кіт",
        answers2: "Орел",
        answers3: "Лев",
        answers4: "Дельфін",
        correct: 4
    },
    {
        img: '/6.jpg',
        question: "Для того, щоб зручно керувати швідкістю і напрямком обертання моторів",
        answers1: "Без нього мотори не будуть працювати",
        answers2: "Він потрібен для живлення моторів від 9В",
        answers3: "Для того, щоб зручно керувати швідкістю і напрямком обертання моторів",
        answers4: "Він необхідний для написання програми для моторів",
        correct: 1
    },
];
